app/controllers/auctions_controller.rb

  def index
    auctions = Auction.order created_at: :desc
---
SELECT "auctions".* FROM "auctions" ORDER BY "auctions"."created_at" DESC

  def auction
    Auction.find params[:id]
---
SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]